src/InformationRegisters/ЛогЗагрузки/ЛогЗагрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогЗагрузки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>СтруктураДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект1С</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ОКЕИ</types>
      <types>CatalogRef.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля</types>
      <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      <types>CatalogRef.БоевыеЧасти</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.ПредметыСнабженияНАТО</types>
      <types>CatalogRef.Помещения</types>
      <types>DocumentRef.Заявка</types>
      <types>CatalogRef.ПроектыКораблей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      <types>CatalogRef.ОКСМ</types>
      <types>CatalogRef.ЗаказыПрисоединенныеФайлы</types>
      <types>CatalogRef.РазделыСпецификацииЗИП</types>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОчередьОбновленияНаименованийКомплектующихИзделийИЗИП/ОчередьОбновленияНаименованийКомплектующихИзделийИЗИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОбновленияНаименованийКомплектующихИзделийИЗИП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ГруппыДоступа/ГруппыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыДоступа</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Администраторы</name>
      <description>Администраторы</description>
    </items>
  </predefined>
  <attributes>
    <name>Профиль</name>
    <type>
      <types>CatalogRef.ПрофилиГруппДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <comment>Только для персональных групп доступа</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяГруппаДоступаПоставляемогоПрофиля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ВнешниеПользователи</types>
        <types>CatalogRef.ГруппыВнешнихПользователей</types>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыДоступа</name>
    <attributes>
      <name>ВидДоступа</name>
      <comment>Представлен пустой ссылкой основного типа значений</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ВсеРазрешены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияДоступа</name>
    <attributes>
      <name>ВидДоступа</name>
      <comment>Представлен пустой ссылкой основного типа значений</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/ОбщиеФункцииПривилегированный/Module.bsl
Процедура ЗаписатьВЛог(ГУИД, Ссылка, ПутьКФайлу="", ИдентификаторСтроки=Неопределено, Описание="", СтруктураДанных=Неопределено) Экспорт
	
	// возврат;
	
	МЗ = РегистрыСведений.ЛогЗагрузки.СоздатьМенеджерЗаписи();
	МЗ.ГУИД = ГУИД;
	МЗ.Файл = "";
	МЗ.ПутьКФайлу = ПутьКФайлу;
	МЗ.Объект1С = Ссылка;
	МЗ.Период = ТекущаяДата();
	МЗ.ИдентификаторСтроки = ИдентификаторСтроки;
	МЗ.Описание = Описание;
	МЗ.СтруктураДанных = СтруктураДанных;
	Попытка
		МЗ.Записать(Истина);
	Исключение
	    ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры



// Добавляет предмет снабжения в очередь для обновления наименований КомплектующихИзделийИЗИП
//
Процедура ДоавитьВОчередьОбновленияНаименованийКомплектующихИзделийИЗИП(Дата, ПредметСнабжения) Экспорт
	
	ОчередьМенеджерЗаписи = РегистрыСведений.ОчередьОбновленияНаименованийКомплектующихИзделийИЗИП.СоздатьМенеджерЗаписи();
	ОчередьМенеджерЗаписи.Период = Дата;
	ОчередьМенеджерЗаписи.ПредметСнабжения = ПредметСнабжения;
	ОчередьМенеджерЗаписи.Записать();
	
КонецПроцедуры

// Получает значение доступа из группы по текущему пользователю
//
Функция ПолучитьЗначениеДоступа(Пользователь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступаПользователи.Ссылка КАК Ссылка,
	|	ЗначенияГруппДоступа.ЗначениеДоступа КАК ЗначениеДоступа
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияГруппДоступа КАК ЗначенияГруппДоступа
	|		ПО ГруппыДоступаПользователи.Ссылка = ЗначенияГруппДоступа.ГруппаДоступа
	|			И (ЗначенияГруппДоступа.ЗначениеРазрешено)
	|ГДЕ
	|	ГруппыДоступаПользователи.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Массив = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Массив.Добавить(Выборка.ЗначениеДоступа);
		
	КонецЦикла; 
	
	Возврат Массив;
	
КонецФункции
